# Бесполезные факты
#
# Узнает у пользователя его / ее личные данные и выдает несколько фактов
# о нем / о ней. Эти факты истинны, но совершенно бесполезны

# глава 2 учебника Доусона

name=input("Привет. Как тебя зовут? ")
age=input("Сколько тебе лет? ")
age=int(age)
weight=int(input("Хорошо. Последний вопрос. Сколько ты весишь кг? "))
print("\nЕсли бы тебя хотели позвать шепотом, то сделали бы так: ",name.lower())
print("\nА если бы прокричали, то так: ",name.upper())
called=name*5
print("\nЕсли бы маленький ребенок решил привлечь твое внимание, ")
print("он произнес бы твое имя так: ")
print(called)
seconds=age*365*24*60*60
print("\nТвой нынешний возраст - свыше",seconds,"секунд")
moon_weight=weight/6
print("\nЗнаете ли вы, что на Луне вы веслили бы всего",moon_weight,"кг?")
sun_weight=weight*27.1
print("\nА вот находясь на Солнце, вы бы весили",sun_weight,"кг. (Но, увы, это продолжалось бы недолго...)")
input("\n\nНажмите Enter, чтобы завершить.")
