# Забавные строки
# Демонстрирует сцепление и повторение строк

# глава 2 учебника Доусона

print("Две строки можно " + "сцепить с помощью оператора '+'.")
print("\nЭта строка " + "вряд ли " + "уди" + "вит вас. " \
      + "Но интересно, " + "что" + " она - \n" + "одна длинная-длин" \
      + "на" + "я" + " строка, сцепленная " \
      + "из " + "двадцати двух\n" + "отдельных строк, разбитых " \
      + "на шесть строк." + " Достаточно ли вы" + " впечатлены? " + "Ну хватит.\n" \
      + "вот " + "наша " + "длинная" + " строка и закончилась!")
print("\nЕсли текст нравится, его можно и повторить. К примеру,")
print("кто не любит пирожных? Только дураки не любят пирожных. А")
print("раз мы люди честные, то выскажемся о своих симптиях")
print("откровенно:")
print("Пирожные" * 10)
input("\n\nНажмите Enter, чтобы выйти.")
