# Рантье (версия с ошибкой)
# Демонстрирует логическую ошибку

# глава 2 учебника Доусона

print(
    """
                 Рантье.
    Программа подсчитывает Ваши ежемесячные расходы. Эту статистику нужно знать,
    чтобы у Вас не закончились деньги и Вам не пришлось искать работу.
    Введите суммы расходов по всем статьям, перечисляемым ниже. Вы богаты -
    так не мелочитесь, пишите суммы в долларах, без центов.
    """
    )
car=input("Техническое обслуживание машины 'Ламборгини': ")
rent=input("Съем роскошной квартиры на Манхеттене: ")
jet=input("Аренда самолета: ")
gifts=input("Подарки: ")
staff=input("Жалование прислуги (дворецкий, повар, водитель, секретарь): ")
guru=input("Плата личному психоаналитику: ")
games=input("Компьютерные игры: ")
food=input("Обеды и ужины в ресторанах: ")
total=car+rent+jet+gifts+staff+guru+games+food
print("\nОбщая сумма: ",total)
input("\n\nНажмите Enter, чтобы выйти.")
