# Рантье (версия без ошибки)
# Демонстрирует type conversion

# глава 2 учебника Доусона

print(
    """
                 Рантье.
    Программа подсчитывает Ваши ежемесячные расходы. Эту статистику нужно знать,
    чтобы у Вас не закончились деньги и Вам не пришлось искать работу.
    Введите суммы расходов по всем статьям, перечисляемым ниже. Вы богаты -
    так не мелочитесь, пишите суммы в долларах, без центов.
    """
    )
car=input("Техническое обслуживание машины 'Ламборгини': ")
car=int(car)
rent=int(input("Съем роскошной квартиры на Манхеттене: "))
jet=int(input("Аренда самолета: "))
gifts=int(input("Подарки: "))
staff=int(input("Жалование прислуги (дворецкий, повар, водитель, секретарь): "))
guru=int(input("Плата личному психоаналитику: "))
games=int(input("Компьютерные игры: "))
food=int(input("Обеды и ужины в ресторанах: "))
total=car+rent+jet+gifts+staff+guru+games+food
print("\nОбщая сумма: ",total)
input("\n\nНажмите Enter, чтобы выйти.")
