# Автодилер
# Ввести стоимость автомобиля. Программа добавит к ней несколько параметров.
print("\nВы собираетсь купить автомобиль, "+
      "но Вам нужно рассчитать стоимость дополнительных трат.")
car=int(input("\nВведите стоимость автомобиля: "))
ins=float(car*0.05)
agent=car*0.025
ship=float(5000)
total=car+ins+agent+ship
print("\nСтраховка 5% :",ins)
print("\nАгентское вознаграждение 2,5% :",agent)
print("\nДоставка :",ship)
print("\nОбщая сумма: ",total)
input("\n\nНажмите Enter, чтобы выйти.")
# не удалось прописать формулу с %
