# Задание, программа, выводящая имя
name="Миша"
print("\nПривет, меня зовут ",name)
input("\nНажмите Enter, чтобы выйти.")
