# Инструкция
# Демонстрирует, как создавать собственные функции

# глава 6 учебника Доусона

def instructions():
    """Выводит на экран инструкцию для игрока."""
    print(
        """
    Добро пожаловать на ринг грандиознейших интеллектуальных состязаний всех времен.
    Твой мозг и мой процессор сойдутся в схватке за доской игры "Крестики-нолики".
    Чтобы сделать ход, введи число от 0 до 8. Числа однозначно соответсвуют полям
    доски так, как показано ниже:

    0 I 1 I 2
    ---------
    3 I 4 I 5
    ---------
    6 I 7 I 8

    Приготовься к бою, жалкий белковый человечишка. Вот-вот начнется решающее сражение.\n
    """
    )


# основная часть
print("Это инструкция для игры в Крестики-нолики: ")
instructions()
print("Это опять та же самая инструкция: ")
instructions()
print("Надеюсь, теперь смысл игры ясен.")
input("\nНажмите Enter, чтобы выйти.")
