# Считалка
# Демонстрирует использование функции range()

## глава 4 учебника Доусона

## Обобщенные переменные-счетчики для перебора чисел в циклах
## принято обозначать i, j, k

print("Посчитаем:")

# первое число всегда 0, последнее число в цикл не включено

for i in range(10):
    print(i, end=" ")
    
# если у функции range три значения = начало/конец/интервал

print("\n\nПеречислм кратые пяти:")
for i in range(0,50,5):
    print(i,end=" ")
print("\n\nПосчитаем в обратном порядке:")
for i in range(10,0,-1):
    print(i,end=" ")
input("\n\nНажмите Enter, чтобы выйти.")    
