# Только гласные
# Демонстрирует, как создавать новые строки из исходных с помощью цикла for

## глава 4 учебника Доусона

message=input("Введите текст: ")
# Пишем сообщение: Он ненавидит гласные!
# новая строка имеет пустую переменную
new_message=""
# переменная прописными буквами называется КОНСТАНТОЙ -значения, которые
# являются постоянными величинами, их не предполагается менять
# в данном случае константа - VOWELS
VOWELS="aeiouаеёиоуыэюя"
print()
for letter in message:
# команда lower() нужна, чтобы программа сопоставляла буквы только в нижнем
# регистре, как в VOWELS, т.к. программа не воспримет заглавное "О" как "о".
    if letter.lower() not in VOWELS:
        new_message+=letter
        print("Создана новая строка:",new_message)
print("\nВот ваш текст с изъятыми гласными буквами:",new_message)
input("\nНажмите Enter, чтобы выйти.")
