# Арсенал героя
# Демонстрирукет создание кортежа

# урок 4 учебника Доусона

# создаем пустой кортеж
inventory=()
# рассмотрим его как условие
if not inventory:
    print("Вы безоружны.")
input("\nНажмите Enter, чтобы продолжить.")
# теперь создадим кортеж с несколькими элементами
inventory=("меч",
           "кольчуга",
           "щит",
           "целебное снадобье")
# выведем этот кортеж на экран
print("Содержимое кортежа:")
print(inventory)
# выведем все элементы последовательно
print("\nИтак, в вашем арсенале:")
for item in inventory:
    print(item)
input("\nНажмите Enter, чтобы выйти.")    
