# Анаграммы с доработкой

# к каждому слову нужна подсказка
# игрок получает право на подсказку, если у него нет предположений
# ввести ситему начисления очков

import random

# создадим последовательность слов(константу), из которых прога выбирает
WORDS = ("питон", "анаграмма", "простая", "сложная", "ответ", "подстаканник")
# случайным образом выберем из последовательности одно слово
word = random.choice(WORDS)
# создадим переменную, с которой будет затем составлена версия игрока
correct = word
# создадим анаграмму выбранного слова, в которой буквы будут расставлены
# хаотично
jumble = ""
tries = 1
bonus = 0
while word:
    position = random.randrange(len(word))
    jumble += word[position]
    word = word[:position] + word[(position + 1):]
print(
    """
            Добро пожаловать в игру 'Анаграммы'!
        Надо переставить буквы так, чтобы получилось осмысленное слово.
     (Для выхода нажмите Enter, не вводя своей версии.)

     Если Вы отгадаете слово с первого раза - получите 100 очков!
     Каждая последующая попытка будет уменьшать количество очков на 10.
     
     """
)
print("Вот анаграмма:", jumble)
guess = input("\nПопробуйте отгадать исходное слово: ")
while guess.lower() != correct and guess.lower() != "":
    print("К сожалению, вы не правы.")
    if len(jumble) == 5 and "п" in jumble:
        print("\nПодсказка: Это слово обзначает вид змей.\n")
    elif "в" in jumble:
        print("\nПодсказка: Это нужно найти в задаче по математике.\n")
    elif len(jumble) == 7 and "п" in jumble:
        print("\nПодсказка: Это слово-синоним слова \"легкая\".\n")
    elif len(jumble) == 12 and "п" in jumble:
        print("\nПодсказка: Туда устанавливают стакан.\n")
    elif len(jumble) == 9 and "а" in jumble:
        print("\nПодсказка: Как называется эта игра?\n")
    elif len(jumble) == 7 and "а" in jumble:
        print("\nПодсказка: Это слово-синоним слова \"тяжелая\".\n")
    guess = input("Попробуйте отгадать исходное слово: ")
    tries += 1
    bonus -= 10
if guess.lower() == correct:
    print("Да! Именно так! Вы отгадали!\n")
    if tries > 0:
        print("Затрачено попыток:", tries, ". Очков заработано:", 100 + bonus, ".\n")
print("Спасибо за игру!")
input("\nНажмите Enter, чтобы выйти.")
