# Компьютерный датчик настроения
# Демонстрирукет использование elif

# глава 3 учебника Доусона

import random

print("Я ощущаю Вашу энергетику. От моего экрана не скрыто ни одно из Ваших чувств.")
print("Итак, Ваше настроение... ")
mood = random.randint(1, 3)
if mood == 1:
    # радостное
    print("Радостное")
elif mood == 2:
    # так себе
    print("Так себе")
elif mood == 3:
    # прескверное
    print("Прескверное")
else:
    print("Не бывает такого настроения! (Должно быть, Вы совершенно не в себе.)")
input("\nНажмите Enter, чтобы выйти.")
