# Метродотель
# Демонстрирует условную интерпретацию значений

# глава 3 учебника Доусона

print("Добро пожаловать в Шато-де-Перекуси!")
print("Кажется, нынешним вечером у нас все столики заняты.\n")
money=int(input("Сколько рублей вы готовы дать метродотелю на чай?"))
if money:
    print("Прошу прощения, мне сейчас сообщили, что есть один свободный столик. Сюда пожалуйста!")
else:
    print("Присаживайтесь, будьте добры. Придется подождать.")
input("Нажмите Enter, чтобы выйти.")        
