# Урок 3 Задание 1
# Пирожок с сюрпризом
# Симулятор пирожка с "сюрпризом", при запуске отображает 5 различных начинок случайным образом
import random
print("\tА вот и наш пирожок с 'сюрпризом'! Узнай что внутри?")
input("\nНажмите Enter, чтобы узнать, что он...\n")
drop=random.randint(1, 5)
if drop==1:
    print("... с повидлом!")
elif drop==2:
    print("... с капустой!")
elif drop==3:
    print("... с мясом!")
elif drop==4:
    print("... с вишней!")
elif drop==5:
    print("... С ГОВНОМ!")
else:
    print("... с пустотой!")
input("\nНажмите Enter, чтобы выйти.")
