# Виселица
#
# Классическая игра "Виселица". Компьютер случайным образом выбирает слово,
# которое игрок должен отгадать буква за буквой. Если игрок не сумеет
# отгадать за отведенное количество попыток, на экране появится фигурка повешенного.

# глава 5 учебника Доусона

# импорт модуля
import random
# константы
HANGMAN=(
"""
------
|    |
|
|
|
|
|
|
|
----------
""",
"""
------
|    |
|    0 
|
|
|
|
|
|
----------
""",
"""
------
|    |
|    0 
|   -+-  
|
|
|
|
|
----------
""",
"""
------
|    |
|    0 
|  /-+-
|
|
|
|
|
----------
""",
"""
------
|    |
|    0 
|  /-+-/
|
|
|
|
|
----------
""",
"""
------
|    |
|    0 
|  /-+-/   
|    |
|
|
|
|
----------
""",
"""
------
|    |
|    0 
|  /-+-/    
|    |   
|    |   
|   |  
|   |
|
----------
""",
"""
------
|    |
|    0
|  /-+-/
|    |
|    |
|   | |
|   | |
|
----------
""")
# константа - максимальное количество ошибок
MAX_WRONG=len(HANGMAN)-1
# кортеж, из которго компьютер выбирает случайным образом
WORDS=("АМБАССАДОР","ПАРАЛЛЕЛЕПИПЕД","АККУМУЛЯТОР","ТЕРМОМЕТР","ЭКСПОНЕНТА")
# инициализация переменных
word=random.choice(WORDS) # слово для отгадывания
# переменная, для отгаданных букв
so_far="*"*len(word) # по одной звездочке на каждую неизвестную букву
wrong=0 # переменная, количества ошибок игрока
used=[] # список букв, которые предлагал игрок
# создание основного цикла
print("Добро пожаловать в игру 'Виселица'. Удачи вам!")
while wrong<MAX_WRONG and so_far!=word:
    print(HANGMAN[wrong])
    print("Вы уже предлагали следующие буквы:\n",used)
    print("\nОтгаданное вами в слове сейчас выглядит так:\n",so_far)
# получение ответа игрока
    guess=input("\n\nВведите букву: ")
    guess=guess.upper()
    while guess in used:
        print("Вы уже предлагали букву",guess)
        guess=input("\n\nВведите букву: ")
        guess=guess.upper()
    used.append(guess)    
    # проверка наличия буквы в слове
    if guess in word:
        print("\nДа! Буква",guess,"есть в слове!")
        # новая строка so_far с отгаданной буквой или буквами
        new=""
        # перебор значений строк в промежутке заданного слова
        for i in range(len(word)):
            if guess==word[i]:
                new+=guess
            else:
                new+=so_far[i]
        so_far=new
    else:
        print("\nК сожалению, буквы",guess,"нет в слове.")
        wrong+=1
# завершение игры
if wrong==MAX_WRONG:
    print(HANGMAN[wrong])
    print("\nВас повесили!")
else:
    print("\nВы отгадали!")
print("\nБыло загадано слово",word)
input("\n\nНажмите Enter, чтобы выйти.")
